Repository: mr258876/PRISM-Utility
Catalog: PRISM Utility/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# ScanDebug_Runtime_FilmProfileDirtyConfirmationStayButton
source: Keep editing
zh_cn: 继续编辑

# ScanDebug_Runtime_FilmProfileDirtyConfirmationDiscardButton
source: Discard changes
zh_cn: 丢弃更改

# ScanDebug_FilmProfileWorkbenchDirtyConfirmationStayButton.Content
source: Keep editing
zh_cn: 继续编辑

# ScanDebug_FilmProfileWorkbenchDirtyConfirmationDiscardButton.Content
source: Discard changes
zh_cn: 丢弃更改

# ScanDebug_Runtime_FilmProfileImportDiscardConfirmationTitle
source: Discard pending import result
zh_cn: 丢弃待处理导入结果

# ScanDebug_Runtime_FilmProfileImportDiscardConfirmationMessage
source: The current import result, including any staged profile or import errors, will be discarded before creating a new film profile. Current workspace settings are unchanged until you confirm.
zh_cn: 新建配置会丢弃暂存配置或导入错误。取消则保留当前设置。

# ScanDebug_FilmProfileWorkbenchImportDiscardConfirmationTitle.Text
source: Discard pending import result
zh_cn: 丢弃待处理导入结果

# ScanDebug_FilmProfileWorkbenchImportDiscardConfirmationMessage.Text
source: The current import result, including any staged profile or import errors, will be discarded before creating a new film profile. Current workspace settings are unchanged until you confirm.
zh_cn: 新建配置会丢弃暂存配置或导入错误。取消则保留当前设置。

# ScanDebug_Runtime_FilmProfileImportReplacementConfirmationTitle
source: Replace pending import result
zh_cn: 替换待处理导入结果

# ScanDebug_Runtime_FilmProfileImportReplacementConfirmationMessage
source: Choosing another file will replace the current import result, including any staged profile or import errors. Canceling the file picker keeps the current import result.
zh_cn: 选择其他文件会替换暂存配置或导入错误。取消则保留当前结果。

# ScanDebug_Runtime_FilmProfileImportReplacementConfirmationOpenButton
source: Open profile JSON
zh_cn: 打开配置 JSON

# ScanDebug_FilmProfileWorkbenchImportReplacementConfirmationTitle.Text
source: Replace pending import result
zh_cn: 替换待处理导入结果

# ScanDebug_FilmProfileWorkbenchImportReplacementConfirmationMessage.Text
source: Choosing another file will replace the current import result, including any staged profile or import errors. Canceling the file picker keeps the current import result.
zh_cn: 选择其他文件会替换暂存配置或导入错误。取消则保留当前结果。

# ScanDebug_FilmProfileWorkbenchJsonSavePrecise.Content
source: Export configuration JSON
zh_cn: 导出配置 JSON

# ScanDebug_FilmProfileWorkbenchCalibrationLibrarySavePrecise.Content
source: Save selected channel calibration to library
zh_cn: 将所选通道校准保存到校准库

# ScanDebug_FilmProfileWorkbenchCalibrationLibraryRemovePrecise.Content
source: Remove selected channel calibration from library
zh_cn: 从校准库移除所选通道校准

# ScanDebug_AcquisitionTransportStrategyTitle.Text
source: Transport strategy
zh_cn: 传送策略

# ScanDebug_AcquisitionTransportStrategyHelpText.Text
source: Return to start scans every selected channel in the same physical direction, then returns before the next channel. Alternate direction scans adjacent selected channels in opposite directions and relies on matching geometry.
zh_cn: 返回起点会让每个所选通道按相同物理方向扫描，并在下一个通道前返回。交替方向会让相邻所选通道按相反方向扫描，并依赖匹配的几何。

# ScanDebug_AcquisitionTransportStrategySafetyText.Text
source: Changes the current profile draft transport strategy only. Geometry and timing checks still block unsafe motion.
zh_cn: 仅修改当前草稿的传送策略。 几何与时序预检仍会阻止不安全运动。

# ScanDebug_AdvancedAdcAdjustmentTitle.Text
source: Advanced ADC manual adjustment
zh_cn: 高级 ADC 手动调整

# ScanDebug_AdvancedAdcAdjustmentHelpText.Text
source: Manual ADC offset and gain overrides for the selected channel.
zh_cn: 手动调整 ADC 偏移与增益。 仅影响所选通道。

# ScanDebug_AdvancedAdcAdjustmentScopeText.Text
source: Edits stay in the current channel draft. Apply Parameters writes the selected channel values to the device only. Save channel calibration persists only the selected library profile.
zh_cn: 编辑仅更新当前通道草稿。 应用参数时，仅写入设备。 保存校准才写入标定库。 仅更新所选通道，其余通道不变。

# ScanDebug_DeviceClockUnitRangeText.Text
source: Legal range: 30-200 MHz. Apply sends the device-global clock command and does not save a channel profile. Device Flash persistence is unverified.
zh_cn: 合法范围：30-200 MHz。 应用发送设备全局时钟命令，不保存通道配置。 设备 Flash 持久化行为尚未验证。

# ScanDebug_Runtime_DeviceClockReadyReason
source: Ready to apply the device-global clock.
zh_cn: 可以应用设备全局时钟。

# ScanDebug_Runtime_ChannelParametersReadyReason
source: Ready to apply the selected channel parameters to the device.
zh_cn: 可以把所选通道参数应用到设备。

# ScanDebug_Runtime_SessionIlluminationReadyReason
source: Ready to send a session-only illumination test to the connected device.
zh_cn: 可以向已连接设备发送仅当前会话的照明测试。

# ScanDebug_Runtime_DeviceClockInvalidReason
source: Enter a device clock from 30 to 200 MHz, with at most three decimal places.
zh_cn: 请输入 30 到 200 MHz 的设备时钟，最多三位小数。

# ScanDebug_Runtime_DeviceClockReadRequiredReason
source: Read or re-apply the device clock before this command can safely touch channel timing or hardware motion.
zh_cn: 读取或重新应用设备时钟后，此命令才能安全触及时序或硬件运动。
